alter session set NLS_DATE_FORMAT = 'DD.MM.YYYY HH24:MI:SS'
Begin
admin.pkgadmin.add_product('Sea-Dweller DIO ',' Sea-Dweller DIO Ц ультрапрочные дайверские часы, специально разработанные Rolex дл€ подводных исследований. ћодель Rolex Sea-Dweller, 
выпущенна€ в 1967 году, водонепроницаема до глубины 1220 метров, модель Rolex Deepsea, по€вивша€с€ в 2008 году, Ц до глубины 3900 метров.
Ёто высшее достижение Rolex в области часовых технологий, используемых в дайверских часах, и результат многолетнего сотрудничества часовой марки с профессионалами дайвинга.',
35,'165000','10','2.jpg');
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgadmin.add_amount('1','100');
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgadmin.set_inactive;
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgadmin.top_clients;
end;
select * from product;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgadmin.change_price(1,'50000');
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgadmin.change_img (2,'1.jpg');
end; 
-------------------------------------------------------------------------------------------------------------------------------
 Begin
admin.pkgadmin.import_csv;
end;
-------------------------------------------------------------------------------------------------------------------------------
 Begin
admin.pkgadmin.export_csv;
end;
-------------------------------------------------------------------------------------------------------------------------------
 Begin
admin.pkgadmin.change_iblob(2,'2.jpg');
end;
-------------------------------------------------------------------------------------------------------------------------------
 Begin
admin.pkgadmin.change_iclob(2,'1.txt');
end;
------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgadmin.export_product_csv;
end;

------------------------------------------------------------------------------------------------------------------------------
delete  basket;
delete  order_detail;
delete  orders;
delete  product;
delete client;