Set serveroutput on;
Begin
admin.pkgclient.add_client('Богдан','Харингтонов','М','xarington@mail.ru','12345');
end;
Begin
admin.pkgclient.add_client('Василий','Иконов','М','ikonov.2011@mail.ru','1234');
end;
Begin
admin.pkgclient.add_client('Виктория','Антонова','Ж','vicktoria.2015@mail.ru','12346');
end;
-------------------------------------------------------------------------------------------------------------------------------
var i number;
exec :i :=admin.pkgclient.logging('ikonov.2011@mail.ru','1234');

var i number;
exec :i :=admin.pkgclient.logging('xarington@mail.ru','12345');

var i number;
exec :i :=admin.pkgclient.logging('vicktoria.2015@mail.ru','12346');
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgclient.exit;
end;
-------------------------------------------------------------------------------------------------------------------------------
Select id,name,description,amount,price,discount,img,iblob,iclob from admin.product where status='ACTIVE';
-------------------------------------------------------------------------------------------------------------------------------
 Begin
admin.pkgclient.add_basket(2,10);
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgclient.watch_basket;
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgclient.clear_all_basket;
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgclient.clear_choosen_products(1,5);
end;
-------------------------------------------------------------------------------------------------------------------------------
 Begin
admin.pkgclient.creat_orders('B');
end;
-------------------------------------------------------------------------------------------------------------------------------
Begin
admin.pkgclient.watch_orders;
end;
-------------------------------------------------------------------------------------------------------------------------------
 

